devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c.c
        return wait_for_I2C_event(hdl, I2C_SR1_SB);
}

//==============================================================================
/**
 * @brief  Function generate REPEAT START sequence on I2C bus
 * @param  hdl                  device handle
 * @return One of errno value.
 */
//==============================================================================
static int _I2C_LLD__repeat_start(I2C_dev_t *hdl)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

        CLEAR_BIT(i2c->CR1, I2C_CR1_STOP);
        SET_BIT(i2c->CR1, I2C_CR1_START | I2C_CR1_ACK);

        u32_t tref = sys_time_get_reference();

        while (!(i2c->SR1 & I2C_SR1_SB)) {
                if (sys_time_is_expired(tref, DEVICE_TIMEOUT)) {
                        return EIO;
                }

                if (i2c->SR1 & (I2C_SR1_ARLO | I2C_SR1_BERR)) {
                        return EIO;
                }
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function generate STOP sequence on I2C bus
 * @param  hdl                  device handle
 * @return On success true is returned, otherwise false
 */
//==============================================================================
static void _I2C_LLD__stop(I2C_dev_t *hdl)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

        SET_BIT(i2c->CR1, I2C_CR1_STOP);
}

//==============================================================================
/**
 * @brief  Function send I2C address sequence
 * @param  hdl                  device handle
 * @param  write                true: compose write address
 * @return On success true is returned, otherwise false
 */
//==============================================================================
static int _I2C_LLD__send_address(I2C_dev_t *hdl, bool write)
{
        int err = EIO;

        I2C_TypeDef *i2c = get_I2C(hdl);

        if (hdl->config.addr_10bit) {
                u8_t hdr = HEADER_ADDR_10BIT | ((hdl->config.address >> 7) & 0x6);

                // send header + 2 most significant bits of 10-bit address
                i2c->DR = HEADER_ADDR_10BIT | ((hdl->config.address & 0xFE) >> 7);
                err = wait_for_I2C_event(hdl, I2C_SR1_ADD10);
                if (err) goto finish;

                // send rest 8 bits of 10-bit address
                u8_t  addr = hdl->config.address & 0xFF;
                u16_t tmp  = i2c->SR1;
                (void)tmp;   i2c->DR = addr;
                err = wait_for_I2C_event(hdl, I2C_SR1_ADDR);
                if (err) goto finish;

                clear_send_address_event(hdl);

                // send repeat start
                err = _I2C_LLD__start(hdl);
                if (err) goto finish;

                // send header
                i2c->DR = write ? hdr : hdr | 0x01;
                err = wait_for_I2C_event(hdl, I2C_SR1_ADDR);

        } else {
                _GPIO_DDI_set_pin(IOCTL_GPIO_PORT_IDX__TEST3, IOCTL_GPIO_PIN_IDX__TEST3); // TEST

                        u16_t tmp = i2c->SR1;
                              tmp = i2c->SR2;
                        (void)tmp;
                        i2c->DR = write ? (hdl->config.address & 0xFE) : (hdl->config.address | 0x01);
                err = wait_for_I2C_event(hdl, I2C_SR1_ADDR);

                _GPIO_DDI_clear_pin(IOCTL_GPIO_PORT_IDX__TEST3, IOCTL_GPIO_PIN_IDX__TEST3); // TEST
        }

        finish:
        if (!err) {
                clear_send_address_event(hdl);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Clear event of send address
 * @param  hdl                  device handle
 * @return None
 */
//==============================================================================
static void clear_send_address_event(I2C_dev_t *hdl)
{
        I2C_TypeDef *i2c = get_I2C(hdl);

        sys_critical_section_begin();
        {
                u16_t tmp;
                tmp = i2c->SR1;
                tmp = i2c->SR2;
                (void)tmp;
        }
        sys_critical_section_end();
}

//==============================================================================
/**
 * @brief  Function send subaddress to I2C device
 * @param  hdl                  device handle
 * @param  address              subaddress
 * @param  mode                 size of subaddress
 * @return On success true is returned, otherwise false
 */
//==============================================================================
static int send_subaddress(I2C_dev_t *hdl, u32_t address, I2C_sub_addr_mode_t mode)
{
        int err = EIO;
        u8_t   n   = 0;
        u8_t   addr[4];

        switch (mode) {
        case I2C_SUB_ADDR_MODE__3_BYTES: addr[n++] = address >> 16;
        case I2C_SUB_ADDR_MODE__2_BYTES: addr[n++] = address >> 8;
        case I2C_SUB_ADDR_MODE__1_BYTE : addr[n++] = address & 0xFF;
                size_t wrcnt = 0;
                err = _I2C_LLD__transmit(hdl, addr, n, &wrcnt);
                        break;

        default:
                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function receive bytes from I2C bus (master-receiver)
 * @param  hdl                  device handle
 * @param  dst                  destination buffer
 * @param  count                number of bytes to receive
 * @return Number of received bytes
 */
//==============================================================================
static int _I2C_LLD__receive(I2C_dev_t *hdl, u8_t *dst, size_t count, size_t *rdcnt)
{
        int          err = EIO;
        ssize_t      n   = 0;
        I2C_TypeDef *i2c = get_I2C(hdl);

        if (count == 2) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                SET_BIT(i2c->CR1, I2C_CR1_POS);
        } else {
                CLEAR_BIT(i2c->CR1, I2C_CR1_POS);
                SET_BIT(i2c->CR1, I2C_CR1_ACK);
        }

        if (count >= 3) {
                clear_send_address_event(hdl);

#if USE_DMA > 0
                if (I2C[hdl->major]->use_DMA) {
                        DMA_Stream_TypeDef *DMA = const_cast(DMA_Stream_TypeDef*,
                                                             I2C_INFO[hdl->major].DMA_rx);

                        DMA->PAR  = cast(u32_t, &i2c->DR);
                        DMA->M0AR = cast(u32_t, dst);
                        DMA->NDTR = count;

                        clear_DMA_IRQ_flags(hdl->major);

                        DMA->CR = ((I2C_INFO[hdl->major].DMA_channel & 7) << DMA_SxCR_CHSEL_Pos)
                                | DMA_SxCR_MINC | DMA_SxCR_TCIE | DMA_SxCR_TEIE;

